Revit 2024 API
BuiltInFailures.RebarSystemFailures.ThinHostWallError Property
 Rebar Cover Interior and Exterior are too large for host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ThinHostWallError { get; }
Visual Basic
Public Shared ReadOnly Property ThinHostWallError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ThinHostWallError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace